000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. user-input.
000003 AUTHOR. ben-james-davis.
000004 DATE-WRITTEN. 28th-november-2023.
000005
000006 DATA DIVISION.
000007  WORKING-STORAGE SECTION. 
000008   01 user-name PIC X(30) VALUE ZERO.
000009
000010 PROCEDURE DIVISION.
000011     DISPLAY "Enter your name: " WITH NO ADVANCING.
000012     ACCEPT user-name.
000013     DISPLAY "Hello there, " user-name.
000014
000015     STOP RUN.
